1. Импортируйте библиотеку Numpy и дайте ей псевдоним np.
Создайте массив Numpy под названием a размером 5x2, то есть состоящий из 5 строк и 2 столбцов.
Первый столбец должен содержать числа 1, 2, 3, 3, 1, а второй — числа 6, 8, 11, 10, 7.
Будем считать, что каждый столбец — это признак, а строка — наблюдение.
Затем найдите среднее значение по каждому признаку, используя метод mean массива Numpy.
Результат запишите в массив mean_a, в нем должно быть 2 элемента.

In [1]:
import numpy as np

In [2]:
a = np.array([1,6,2,8,3,11,3,10,1,7]).reshape(5,2)

In [3]:
a

array([[ 1,  6],
       [ 2,  8],
       [ 3, 11],
       [ 3, 10],
       [ 1,  7]])

In [5]:
mean_a = a.mean(axis=0)

In [6]:
mean_a

array([2. , 8.4])

2. Вычислите массив a_centered, отняв от значений массива а 
средние значения соответствующих признаков, содержащиеся в массиве mean_a.
Вычисление должно производиться в одно действие.
Получившийся массив должен иметь размер 5x2.

In [8]:
a_centered = a - mean_a

In [9]:
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

3. Найдите скалярное произведение столбцов массива a_centered.
В результате должна получиться величина a_centered_sp. 
Затем поделите a_centered_sp на N-1, где N - число наблюдений.

In [11]:
a_centered_sp = np.dot(a_centered[:, 0], a_centered[:, 1])

In [12]:
a_centered_sp

8.0

In [13]:
a_centered_sp / (a.shape[0]-1)

2.0

4. Число, которое мы получили в конце задания 3, является 
ковариацией двух признаков, содержащихся в массиве а.
В задании 3 мы делили сумму произведений центрированных 
признаков на N-1, а не на N, поэтому полученная нами величина 
является несмещенной оценкой ковариации.

In [14]:
matrix_cov = np.cov(m = a.T)

In [15]:
matrix_cov

array([[1. , 2. ],
       [2. , 4.3]])

In [16]:
matrix_cov[0, 1]

2.0

1. Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price,
в которых соответственно содержатся данные: 
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].
Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.
Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.
Создайте датафрейм authors_stat на основе информации из authors_price.
В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора,
минимальная, максимальная и средняя цена на книги этого автора.

In [17]:
import pandas as pd

In [18]:
authors = pd.DataFrame({'author_id':[1,2,3], 'author_name':['Тургенев', 'Чехов', 'Островский']}, \
                       columns=['author_id','author_name'])

In [19]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [20]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], \
                     'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', \
                                   'Толстый и тонкий', 'Дама с собачкой', 'Гроза', \
                                   'Таланты и поклонники'], \
                    'price':[450, 300, 350, 500, 450, 370, 290]}, \
                   columns=['author_id','book_title', 'price'])

In [21]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [22]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'inner')

In [23]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [24]:
top5 = authors_price.nlargest(5, 'price')

In [25]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [29]:
authors_stat = authors_price.groupby('author_name')['price'].agg(['min', 'max', 'mean']).reset_index()

In [30]:
authors_stat

  author_name  min  max        mean
0  Островский  290  370  330.000000
1    Тургенев  300  450  366.666667
2       Чехов  450  500  475.000000

2. Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги — твердая или мягкая. В этот столбец поместите данные из следующего списка: ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].
Просмотрите документацию по функции pd.pivot_table 
с помощью вопросительного знака.
Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию pd.pivot_table. 
При этом столбцы должны называться «твердая» и «мягкая»,
а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy.
Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl".
Затем загрузите из этого файла датафрейм и назовите его book_info2.
Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.

In [31]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [32]:
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [33]:
?pd.pivot_table

In [34]:
book_info = pd.pivot_table(data = authors_price, values='price', index='author_name', columns='cover', aggfunc=sum).fillna(0).reset_index()

In [35]:
book_info

cover author_name  мягкая  твердая
0      Островский   660.0      0.0
1        Тургенев   650.0    450.0
2           Чехов     0.0    950.0

In [36]:
book_info.to_pickle('book_info.pkl')

In [37]:
book_info2 = pd.read_pickle('book_info.pkl')

In [39]:
book_info2.equals(book_info)

True

In [40]:
book_info2

cover author_name  мягкая  твердая
0      Островский   660.0      0.0
1        Тургенев   650.0    450.0
2           Чехов     0.0    950.0